ChipstackLTD/Zerobase/boards.txt
# Optimizations
CH32L10x_EVT.menu.opt.osstd=Smallest (-Os default)
CH32L10x_EVT.menu.opt.osstd.build.flags.optimize=-Os
CH32L10x_EVT.menu.opt.oslto=Smallest (-Os) with LTO
CH32L10x_EVT.menu.opt.oslto.build.flags.optimize=-Os -flto
CH32L10x_EVT.menu.opt.o1std=Fast (-O1)
CH32L10x_EVT.menu.opt.o1std.build.flags.optimize=-O1
CH32L10x_EVT.menu.opt.o1lto=Fast (-O1) with LTO
CH32L10x_EVT.menu.opt.o1lto.build.flags.optimize=-O1 -flto
CH32L10x_EVT.menu.opt.o2std=Faster (-O2)
CH32L10x_EVT.menu.opt.o2std.build.flags.optimize=-O2
CH32L10x_EVT.menu.opt.o2lto=Faster (-O2) with LTO
CH32L10x_EVT.menu.opt.o2lto.build.flags.optimize=-O2 -flto
CH32L10x_EVT.menu.opt.o3std=Fastest (-O3)
CH32L10x_EVT.menu.opt.o3std.build.flags.optimize=-O3
CH32L10x_EVT.menu.opt.o3lto=Fastest (-O3) with LTO
CH32L10x_EVT.menu.opt.o3lto.build.flags.optimize=-O3 -flto
CH32L10x_EVT.menu.opt.ogstd=Debug (-Og)
CH32L10x_EVT.menu.opt.ogstd.build.flags.optimize=-Og
CH32L10x_EVT.menu.opt.o0std=No Optimization (-O0)
CH32L10x_EVT.menu.opt.o0std.build.flags.optimize=-O0


# Debug information
CH32L10x_EVT.menu.dbg.none=None
CH32L10x_EVT.menu.dbg.none.build.flags.debug=-DNDEBUG
CH32L10x_EVT.menu.dbg.enable_sym=Symbols Enabled (-g)
CH32L10x_EVT.menu.dbg.enable_sym.build.flags.debug=-g -DNDEBUG
CH32L10x_EVT.menu.dbg.enable_log=Core logs Enabled
CH32L10x_EVT.menu.dbg.enable_log.build.flags.debug=
CH32L10x_EVT.menu.dbg.enable_all=Core Logs and Symbols Enabled (-g)
CH32L10x_EVT.menu.dbg.enable_all.build.flags.debug=-g


# C Runtime Library
CH32L10x_EVT.menu.rtlib.nano=Newlib Nano (default)
CH32L10x_EVT.menu.rtlib.nano.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs
CH32L10x_EVT.menu.rtlib.nanofp=Newlib Nano + Float Printf
CH32L10x_EVT.menu.rtlib.nanofp.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float
CH32L10x_EVT.menu.rtlib.nanofs=Newlib Nano + Float Scanf
CH32L10x_EVT.menu.rtlib.nanofs.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _scanf_float
CH32L10x_EVT.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
CH32L10x_EVT.menu.rtlib.nanofps.build.flags.ldflags=--specs=nano.specs --specs=nosys.specs -u _printf_float -u _scanf_float
CH32L10x_EVT.menu.rtlib.full=Newlib Standard
CH32L10x_EVT.menu.rtlib.full.build.flags.ldflags=--specs=nosys.specs

